{
    "experiences": [
        {
            "title": "Analista de Recursos Humanos",
            "period": "9/2022 - 1/2023",
            "company": "HCL Technologies",
            "position": "Analista de Recursos Humanos",
            "activities": [
                "Apoyar las operaciones de RR. HH. para mantener la información y los documentos de los empleados en línea con las políticas de la empresa.",
                "Recuperar información del archivo de la empresa y crear macros para almacenarla automáticamente.",
                "Crear informes y presentaciones para el departamento de RR. HH."
            ],
            "technologies": [
                "Excel",
                "Microsoft SharePoint",
                "Habilidades de comunicación",
                "Trabajo en equipo"
            ]
        },
        {
            "title": "Desarrollador Web",
            "period": "1/2023 - 10/2024",
            "company": "Freelance",
            "position": "Desarrollador Web",
            "activities": [
                "Desarrollé el lado CRM del sistema y parte de la gestión de inventarios, desarrollando funcionalidades para capturar, almacenar y consultar información desde la base de datos.",
                "Diseñé nuevas tablas para apoyar los requisitos del negocio, asegurando la integridad de los datos, la normalización y un rendimiento óptimo.",
                "Participé en el equipo de desarrollo de un ERP de código abierto basado en la web de una empresa local.",
                "Mantenimiento y mejora de la funcionalidad de los sistemas existentes."
            ],
            "technologies": [
                "SQL",
                "PHP Laravel",
                "JavaScript",
                "HTML/CSS"
            ]
        },
        {
            "title": "Desarrollador de Software",
            "period": "10/2024 - 03/2025",
            "company": "Freelance",
            "position": "Desarrollador de Software",
            "activities": [
                "Desarrollar aplicaciones web Full-Stack.",
                "Diseñar sitios web, aplicaciones, bases de datos y software desde cero utilizando las mejores prácticas.",
                "Construir nuevas funcionalidades de productos y APIs para uso interno y externo.",
                "Colaborar con equipos para definir, diseñar y lanzar nuevas funcionalidades o productos."
            ],
            "technologies": [
                "Flask",
                "Vue Js",
                "HTML/CSS",
                "Python",
                "MySQL"
            ]
        },
        {
            "title": "Desarrollador de Software",
            "period": "03/2025 - 06/2025",
            "company": "HPT Center and Planning",
            "position": "Desarrollador de Software",
            "activities": [
                "Desarrollé y mantuve aplicaciones web basadas en Laravel, incluyendo módulos personalizados, middleware y APIs RESTful.",
                "Colaboré en un sistema ERP de código abierto, contribuyendo tanto al desarrollo front-end como back-end.",
                "Creé interfaces de usuario escalables y responsivas utilizando plantillas Blade, CSS y Bootstrap.",
                "Construí y documenté APIs para la integración con servicios de terceros."
            ],
            "technologies": [
                "Laravel",
                "MySQL",
                "Docker",
                "Git",
                "JavaScript",
                "HTML/CSS"
            ]
        }
    ]
}